# ElectricalTemperature Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..ElectricalTemperature Property
SpecTypeId Class See Also
---
Temperature, in discipline Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId ElectricalTemperature { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElectricalTemperature As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElectricalTemperature {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace